app/controllers/user_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`city`, `activation_key`, `created_at`, `birthdate`, `country`, `activation_expires`, `updated_at`, `admin`, `last_access`, `gender`, `password_salt`, `full_name`, `last_ip`, `display_name`, `time_zone`, `manage_messages`, `password_hash`, `manage_user`, `email`, `state`, `public_profile`, `active`, `manage_rooms`, `online`) VALUES('Campo Grande', '2SdIi4GY0o/e4v6fbg3cr6kkD8Tyj+CVjoS9Lw+xenB9ALeKIGQlpw==', '2010-03-28 08:34:02', '1978-03-09', 'Brasil', '2010-04-07 08:34:02', '2010-03-28 08:34:02', 0, NULL, 'Male', 'dZA2fP27P4zNPg==', 'Alexandre Prates', NULL, 'Nep', 'GMT -4:00', 0, '39ed0cc38d97295b7321d6f9ef658ca4a90a61fb58b42f651f8b041da82e4d88', 0, 'ajfprates@gmail.com', 'Mato grosso do Sul', 1, 0, 0, 0)

  def activate
    user = User.find_by_activation_key(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`activation_key` = 'JylNV67HrWxJGfTpdTggMM8pF912BKNLgKRDReOACDsr31wAvqJwtg==') LIMIT 1